<?php
    /*

    ☆☆☆☆☆돌아온 구구단 제 3탄! 거꾸로 구구단!!!!!!!!!!☆☆☆☆☆

    구구단을 역방향으로 찍히게 해주세요!

    ex)
    9 x 9 = 81
    9 x 8 = 72
    9 x 7 = 63
    ...
    ----------
    8 x 9 = 72
    8 x 8 = 64
    ...
    ----------
    ...
    2 x 1 = 2

    (처음과 마지막에 ---------- 없이!)
    
    */

    for($i=9; $i>1; $i--)
    {
        if($i < 9) { print "-----------<br>"; }
        for($z=9; $z>0; $z--)
        {
            $result = $i * $z;
            print "$i x $z = $result <br>";
        }   
    }

?>
